; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v1 ?v12)
             (pred_3 ?v7 ?v4)
             (pred_4 ?v1 ?v4)
             (pred_6 ?v9 ?v1 )
	     (pred_8 ?v1)
             (pred_2 ?v8)
             (pred_11 ?v7)
             (pred_7 ?v4)
             (pred_12 ?v1)
             (pred_9 ?v7)
             (pred_10 ?v1)
             (pred_1 ))



(:action op_3
:parameters (?v5 ?v10 ?v13 ?v6)
:precondition (and (pred_2 ?v5) (pred_2 ?v10) (pred_11 ?v13) (pred_7 ?v6)
          (pred_5 ?v5 ?v10) (pred_3 ?v13 ?v6)
                   (pred_4 ?v10 ?v6) (pred_8 ?v5) 
                   (pred_12 ?v10) (pred_9 ?v13))
:effect (and  (pred_10 ?v10) (not (pred_12 ?v10))))


(:action op_2
:parameters (?v5 ?v2)
:precondition (and (pred_2 ?v5) (pred_2 ?v2)
               (pred_8 ?v5) (pred_5 ?v5 ?v2) (pred_10 ?v2))
:effect (and (pred_8 ?v2) (not (pred_8 ?v5))))

(:action op_1
:parameters (?v5 ?v13)
:precondition (and (pred_2 ?v5) (pred_11 ?v13) 
                  (pred_8 ?v5) (pred_6 ?v13 ?v5) (pred_1 ))
:effect (and (pred_9 ?v13)
   (not (pred_6 ?v13 ?v5)) (not (pred_1 ))))


(:action op_4
:parameters (?v5 ?v11 ?v3)
:precondition (and (pred_2 ?v5) (pred_11 ?v11) (pred_11 ?v3)
                  (pred_8 ?v5) (pred_9 ?v3) (pred_6 ?v11 ?v5))
:effect (and (pred_9 ?v11) (pred_6 ?v3 ?v5)
        (not (pred_9 ?v3)) (not (pred_6 ?v11 ?v5))))

(:action op_5
:parameters (?v5 ?v13)
:precondition (and (pred_2 ?v5) (pred_11 ?v13) 
                  (pred_8 ?v5) (pred_9 ?v13))
:effect (and (pred_1 ) (pred_6 ?v13 ?v5) (not (pred_9 ?v13)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_07 obj_16 obj_27 obj_30 obj_29 obj_17 obj_20 obj_23 obj_09 obj_12 obj_18 obj_28 obj_13 obj_22 obj_24 obj_02 obj_21 obj_11 obj_01 obj_10 obj_08 obj_15 obj_25 obj_04 obj_26
    obj_19 obj_06
    obj_05 obj_03 obj_14
    )

    (:init
       (pred_1)

       (pred_2 obj_07)
       (pred_2 obj_16)
       (pred_2 obj_27)
       (pred_2 obj_30)
       (pred_2 obj_29)
       (pred_2 obj_17)
       (pred_2 obj_20)
       (pred_2 obj_23)
       (pred_2 obj_09)
       (pred_2 obj_12)
       (pred_2 obj_18)
       (pred_2 obj_28)
       (pred_2 obj_13)
       (pred_2 obj_22)
       (pred_2 obj_24)
       (pred_2 obj_02)
       (pred_2 obj_21)
       (pred_2 obj_11)
       (pred_2 obj_01)
       (pred_2 obj_10)
       (pred_2 obj_08)
       (pred_2 obj_15)
       (pred_2 obj_25)
       (pred_2 obj_04)
       (pred_2 obj_26)
       (pred_7 obj_19)
       (pred_7 obj_06)
       (pred_11 obj_05)
       (pred_11 obj_03)
       (pred_11 obj_14)

       (pred_5 obj_07 obj_17)
       (pred_5 obj_07 obj_16)
       (pred_5 obj_16 obj_20)
       (pred_5 obj_16 obj_27)
       (pred_5 obj_16 obj_07)
       (pred_5 obj_27 obj_23)
       (pred_5 obj_27 obj_30)
       (pred_5 obj_27 obj_16)
       (pred_5 obj_30 obj_09)
       (pred_5 obj_30 obj_29)
       (pred_5 obj_30 obj_27)
       (pred_5 obj_29 obj_12)
       (pred_5 obj_29 obj_30)
       (pred_5 obj_17 obj_18)
       (pred_5 obj_17 obj_20)
       (pred_5 obj_17 obj_07)
       (pred_5 obj_20 obj_28)
       (pred_5 obj_20 obj_23)
       (pred_5 obj_20 obj_16)
       (pred_5 obj_20 obj_17)
       (pred_5 obj_23 obj_13)
       (pred_5 obj_23 obj_09)
       (pred_5 obj_23 obj_27)
       (pred_5 obj_23 obj_20)
       (pred_5 obj_09 obj_22)
       (pred_5 obj_09 obj_12)
       (pred_5 obj_09 obj_30)
       (pred_5 obj_09 obj_23)
       (pred_5 obj_12 obj_24)
       (pred_5 obj_12 obj_29)
       (pred_5 obj_12 obj_09)
       (pred_5 obj_18 obj_02)
       (pred_5 obj_18 obj_28)
       (pred_5 obj_18 obj_17)
       (pred_5 obj_28 obj_21)
       (pred_5 obj_28 obj_13)
       (pred_5 obj_28 obj_20)
       (pred_5 obj_28 obj_18)
       (pred_5 obj_13 obj_11)
       (pred_5 obj_13 obj_22)
       (pred_5 obj_13 obj_23)
       (pred_5 obj_13 obj_28)
       (pred_5 obj_22 obj_01)
       (pred_5 obj_22 obj_24)
       (pred_5 obj_22 obj_09)
       (pred_5 obj_22 obj_13)
       (pred_5 obj_24 obj_10)
       (pred_5 obj_24 obj_12)
       (pred_5 obj_24 obj_22)
       (pred_5 obj_02 obj_08)
       (pred_5 obj_02 obj_21)
       (pred_5 obj_02 obj_18)
       (pred_5 obj_21 obj_15)
       (pred_5 obj_21 obj_11)
       (pred_5 obj_21 obj_28)
       (pred_5 obj_21 obj_02)
       (pred_5 obj_11 obj_25)
       (pred_5 obj_11 obj_01)
       (pred_5 obj_11 obj_13)
       (pred_5 obj_11 obj_21)
       (pred_5 obj_01 obj_04)
       (pred_5 obj_01 obj_10)
       (pred_5 obj_01 obj_22)
       (pred_5 obj_01 obj_11)
       (pred_5 obj_10 obj_26)
       (pred_5 obj_10 obj_24)
       (pred_5 obj_10 obj_01)
       (pred_5 obj_08 obj_15)
       (pred_5 obj_08 obj_02)
       (pred_5 obj_15 obj_25)
       (pred_5 obj_15 obj_21)
       (pred_5 obj_15 obj_08)
       (pred_5 obj_25 obj_04)
       (pred_5 obj_25 obj_11)
       (pred_5 obj_25 obj_15)
       (pred_5 obj_04 obj_26)
       (pred_5 obj_04 obj_01)
       (pred_5 obj_04 obj_25)
       (pred_5 obj_26 obj_10)
       (pred_5 obj_26 obj_04)
       (pred_12 obj_20)
       (pred_12 obj_07)
       (pred_12 obj_22)
       (pred_4  obj_20 obj_19)
       (pred_4  obj_07 obj_06)
       (pred_4  obj_22 obj_19)
       (pred_10 obj_16)
       (pred_10 obj_27)
       (pred_10 obj_30)
       (pred_10 obj_29)
       (pred_10 obj_17)
       (pred_10 obj_23)
       (pred_10 obj_09)
       (pred_10 obj_12)
       (pred_10 obj_18)
       (pred_10 obj_28)
       (pred_10 obj_13)
       (pred_10 obj_24)
       (pred_10 obj_02)
       (pred_10 obj_21)
       (pred_10 obj_11)
       (pred_10 obj_01)
       (pred_10 obj_10)
       (pred_10 obj_08)
       (pred_10 obj_15)
       (pred_10 obj_25)
       (pred_10 obj_04)
       (pred_10 obj_26)

       (pred_3  obj_05 obj_19)
       (pred_3  obj_03 obj_06)
       (pred_3  obj_14 obj_19)
       (pred_6 obj_05 obj_15)
       (pred_6 obj_03 obj_16)
       (pred_6 obj_14 obj_18)
       (pred_8 obj_13)
    )

    (:goal (and
       (pred_6 obj_05 obj_11)
    ))
(:constraints
  (always (not (pred_8 obj_21)))
)
)

; plan
1. (op_2 obj_13 obj_11)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_11)
   goals met: 0 of 1
2. (op_2 obj_11 obj_25)
   deleted: (pred_8 obj_11)
   added: (pred_8 obj_25)
   goals met: 0 of 1
3. (op_2 obj_25 obj_15)
   deleted: (pred_8 obj_25)
   added: (pred_8 obj_15)
   goals met: 0 of 1
4. (op_1 obj_15 obj_05)
   deleted: (pred_6 obj_05 obj_15) (pred_1)
   added: (pred_9 obj_05)
   goals met: 0 of 1
5. (op_2 obj_15 obj_25)
   deleted: (pred_8 obj_15)
   added: (pred_8 obj_25)
   goals met: 0 of 1
6. (op_2 obj_25 obj_11)
   deleted: (pred_8 obj_25)
   added: (pred_8 obj_11)
   goals met: 0 of 1
7. (op_5 obj_11 obj_05)
   deleted: (pred_9 obj_05)
   added: (pred_1) (pred_6 obj_05 obj_11)
   goals met: 1 of 1
